{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "bias": "none",
  "d_initial": 0.1,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "peft_type": "VERA",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "projection_prng_key": 0,
  "r": 32,
  "revision": null,
  "save_projection": true,
  "target_modules": [
    "to_v",
    "add_v_proj",
    "to_qkv_mlp_proj",
    "linear_out",
    "to_k",
    "to_add_out",
    "add_q_proj",
    "linear_in",
    "add_k_proj",
    "to_q",
    "to_out.0"
  ],
  "task_type": null,
  "vera_dropout": 0.0
}