{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "r": 256,
  "psoft_alpha": 256,
  "psoft_dropout": 0.0,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "ab_svd_init": "psoft_init",
  "psoft_svd": "lowrank",
  "psoft_svd_lowrank_niter": 10,
  "psoft_orth": true,
  "psoft_mag_a": true,
  "psoft_mag_b": true,
  "use_cayley_neumann": true,
  "num_cayley_neumann_terms": 5,
  "cayley_neumann_eps": null,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "peft_type": "PSOFT",
  "revision": null,
  "target_modules": null,
  "task_type": null
}
