{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "bias": "none",
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_theta_d_bound": 0.02,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "peft_type": "UNILORA",
  "proj_seed": 42,
  "r": 32,
  "revision": null,
  "target_modules": [
    "q_proj",
    "v_proj"
  ],
  "task_type": "CAUSAL_LM",
  "theta_d_length": 256,
  "unilora_dropout": 0.0
}
