{
  "base_model_name_or_path": "Qwen/Qwen3.5-4B",
  "peft_type": "VBLORA",
  "r": 4,
  "num_vectors": 256,
  "vector_length": 256,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj",
    "gate_proj",
    "up_proj",
    "down_proj"
  ],
  "task_type": "CAUSAL_LM"
}