{
  "alpha": 32,
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "decompose_both": false,
  "decompose_factor": -1,
  "exclude_modules": null,
  "inference_mode": false,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "module_dropout": 0.0,
  "modules_to_save": null,
  "peft_type": "LOKR",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "r": 32,
  "rank_dropout": 0.0,
  "rank_dropout_scale": false,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "to_qkv_mlp_proj",
    "to_add_out",
    "to_out.0",
    "linear_out",
    "add_k_proj",
    "to_v",
    "add_q_proj",
    "add_v_proj",
    "to_k",
    "to_q",
    "linear_in"
  ],
  "task_type": null,
  "use_effective_conv2d": false
}