{
    "alpha_pattern": {},
    "auto_mapping": null,
    "base_model_name_or_path": null,
    "bias": "none",
    "corda_config": null,
    "eva_config": null,
    "exclude_modules": null,
    "fan_in_fan_out": false,
    "inference_mode": false,
    "init_lora_weights": true,
    "layer_replication": null,
    "layers_pattern": null,
    "layers_to_transform": null,
    "loftq_config": {},
    "lora_alpha": 92,
    "lora_bias": false,
    "lora_dropout": 0.0,
    "megatron_config": null,
    "megatron_core": "megatron.core",
    "modules_to_save": null,
    "peft_type": "BDLORA",
    "r": 46,
    "rank_pattern": {},
    "revision": null,
    "target_modules": [
        "q_proj",
        "v_proj",
        "k_proj",
        "up_proj",
        "gate_proj",
        "o_proj",
        "down_proj"
    ],
    "lora_a_is_blockdiagonal": [
        "o_proj",
        "down_proj"
    ],
    "lora_b_is_blockdiagonal": [
        "q_proj",
        "v_proj",
        "k_proj",
        "up_proj",
        "gate_proj"
    ],
    "nblocks": 2,
    "task_type": "CAUSAL_LM",
    "use_dora": false,
    "use_rslora": false
}