{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "bias": "none",
  "block_share": false,
  "coft": false,
  "eps": 6e-05,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "module_dropout": 0.0,
  "modules_to_save": null,
  "num_cayley_neumann_terms": 5,
  "oft_block_size": 32,
  "peft_type": "OFT",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "r": 0,
  "revision": null,
  "target_modules": [
    "to_out.0",
    "to_add_out",
    "to_qkv_mlp_proj",
    "add_k_proj",
    "add_q_proj",
    "add_v_proj",
    "to_add_out",
    "to_k",
    "to_q",
    "to_v",
    "linear_in",
    "linear_out"
  ],
  "task_type": null,
  "use_cayley_neumann": true
}
