{
  "auto_mapping": {
    "base_model_class": "MLP",
    "parent_library": "test_regression"
  },
  "base_model_name_or_path": null,
  "fan_in_fan_out": false,
  "feedforward_modules": [],
  "inference_mode": true,
  "init_ia3_weights": false,
  "modules_to_save": null,
  "peft_type": "IA3",
  "revision": null,
  "target_modules": [
    "lin0"
  ],
  "task_type": null
}