{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "bias": "none",
  "boft_block_num": 0,
  "boft_block_size": 4,
  "boft_dropout": 0.0,
  "boft_n_butterfly_factor": 2,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "peft_type": "BOFT",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "revision": null,
  "target_modules": [
    "linear_in",
    "add_q_proj",
    "add_k_proj",
    "to_qkv_mlp_proj",
    "to_add_out",
    "linear_out",
    "to_k",
    "to_out.0",
    "to_q",
    "to_v",
    "add_v_proj"
  ],
  "task_type": null
}