{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "black-forest-labs/FLUX.2-klein-base-4B",
  "bias": "none",
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "to_out.0",
    "to_add_out",
    "to_qkv_mlp_proj",
    "add_k_proj",
    "add_q_proj",
    "add_v_proj",
    "to_add_out",
    "to_k",
    "to_q",
    "to_v",
    "linear_in",
    "linear_out"
  ],
  "task_type": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}
