{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "beta1": 0.85,
  "beta2": 0.85,
  "bias": "none",
  "corda_config": null,
  "deltaT": 1,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_lora_weights": true,
  "init_r": 32,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.0,
  "lora_ga_config": null,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "orth_reg_weight": 0.5,
  "peft_type": "ADALORA",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "qalora_group_size": 16,
  "r": 8,
  "rank_pattern": null,
  "revision": null,
  "target_modules": [
    "linear_in",
    "add_q_proj",
    "add_k_proj",
    "to_qkv_mlp_proj",
    "to_add_out",
    "linear_out",
    "to_k",
    "to_out.0",
    "to_q",
    "to_v",
    "add_v_proj"
  ],
  "target_parameters": null,
  "target_r": 8,
  "task_type": null,
  "tfinal": 200,
  "tinit": 100,
  "total_step": 750,
  "trainable_token_indices": null,
  "use_bdlora": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}
