{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "bias": "none",
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_weights": false,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "n_frequency": 2000,
  "n_frequency_pattern": {},
  "peft_type": "FOURIERFT",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "random_loc_seed": 777,
  "revision": null,
  "scaling": 150.0,
  "target_modules": [
    "to_v",
    "add_v_proj",
    "to_qkv_mlp_proj",
    "linear_out",
    "to_k",
    "to_add_out",
    "add_q_proj",
    "linear_in",
    "add_k_proj",
    "to_q",
    "to_out.0"
  ],
  "task_type": null
}