{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "hira_dropout": 0.0,
  "inference_mode": false,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "peft_type": "HIRA",
  "r": 32,
  "rank_pattern": {},
  "target_modules": [
    "q_proj",
    "v_proj"
  ],
  "task_type": "CAUSAL_LM"
}
