{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "effective_rank": 32,
  "inference_mode": false,
  "init_weights": null,
  "modules_to_save": null,
  "peft_type": "OSF",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "rank_pattern": null,
  "revision": null,
  "target_modules": [
    "to_out.0",
    "to_add_out",
    "to_qkv_mlp_proj",
    "add_k_proj",
    "add_q_proj",
    "add_v_proj",
    "to_k",
    "to_q",
    "to_v",
    "linear_in",
    "linear_out"
  ],
  "target_svd_config": null,
  "task_type": null
}