{
  "ab_svd_init": "psoft_init",
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "cayley_neumann_eps": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "num_cayley_neumann_terms": 5,
  "peft_type": "PSOFT",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "psoft_alpha": 32,
  "psoft_dropout": 0.0,
  "psoft_mag_a": true,
  "psoft_mag_b": true,
  "psoft_orth": true,
  "psoft_svd": "full",
  "psoft_svd_lowrank_niter": 10,
  "r": 32,
  "revision": null,
  "target_modules": [
    "to_q",
    "add_q_proj",
    "add_k_proj",
    "add_v_proj",
    "to_k",
    "to_v",
    "to_add_out",
    "linear_in",
    "linear_out",
    "to_qkv_mlp_proj",
    "to_out.0"
  ],
  "task_type": null,
  "use_cayley_neumann": false
}