{
  "act_fn": "relu",
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "depth": 0,
  "exclude_modules": null,
  "inference_mode": false,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "peft_type": "PEANUT",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "r": 32,
  "revision": null,
  "scaling": 2.0,
  "target_modules": [
    "q_proj",
    "v_proj"
  ],
  "task_type": null
}