{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "exclude_modules": null,
  "inference_mode": false,
  "modules_to_save": null,
  "peft_type": "LN_TUNING",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "revision": null,
  "target_modules": [
      "norm_q",
      "norm_k"
  ],
  "task_type": null
}
