{
  "base_model_name_or_path": "Qwen/Qwen3.5-4B",
  "peft_type": "DELORA",
  "r": 16,
  "lora_alpha": 16,
  "target_modules": [
    "gate_proj",
    "up_proj",
    "down_proj"
  ],
  "task_type": "CAUSAL_LM"
}