{
  "auto_mapping": {
    "base_model_class": "RobertaForSequenceClassification",
    "parent_library": "transformers.models.roberta.modeling_roberta"
  },
  "base_model_name_or_path": "roberta-base",
  "bias": "none",
  "enforce_sv_positive": true,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_uilinlora_weights": true,
  "modules_to_save": null,
  "peft_type": "UILINLORA",
  "rank": 128,
  "revision": null,
  "scaling_factor": 1.0,
  "target_modules": [
    "classifier.dense"
  ],
  "task_type": null,
  "uilinlora_alpha": 1.0,
  "uilinlora_dropout": 0.0
}