{
  "base_model_name_or_path": "meta-llama/Llama-3.2-3B-Instruct",
  "peft_type": "LORA",
  "r": 32,
  "lora_alpha": 32,
  "target_modules": ["q_proj", "k_proj", "v_proj", "o_proj", "gate_proj", "up_proj", "down_proj"],
  "task_type": "CAUSAL_LM"
}
