{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "bias": "none",
  "d_initial": 0.1,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "peft_type": "VERA",
  "projection_prng_key": 0,
  "r": 256,
  "revision": null,
  "save_projection": true,
  "target_modules": null,
  "task_type": null,
  "vera_dropout": 0.0
}