{
  "base_model_name_or_path": "Qwen/Qwen3.5-4B",
  "peft_type": "DELORA",
  "r": 16,
  "lora_alpha": 16,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj"
  ],
  "task_type": "CAUSAL_LM"
}