{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "bias": "none",
  "fan_in_fan_out": false,
  "frod_dropout": 0.0,
  "inference_mode": false,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "peft_type": "FROD",
  "projection_prng_key": 0,
  "regularization_alpha": 0.001,
  "revision": null,
  "save_projection": true,
  "sparse_rate": 0.02,
  "target_modules": null,
  "task_type": "CAUSAL_LM"
}
