{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "OPTForCausalLM",
    "parent_library": "transformers.models.opt.modeling_opt"
  },
  "base_model_name_or_path": "facebook/opt-350m",
  "beta1": 0.85,
  "beta2": 0.85,
  "bias": "none",
  "deltaT": 1,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": false,
  "init_r": 12,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 8,
  "lora_dropout": 0.0,
  "modules_to_save": null,
  "orth_reg_weight": 0.5,
  "peft_type": "ADALORA",
  "r": 8,
  "rank_pattern": null,
  "revision": null,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "out_proj",
    "fc1",
    "fc2"
  ],
  "target_r": 8,
  "task_type": null,
  "tfinal": 0,
  "tinit": 0,
  "total_step": null
}