{
  "base_model_name_or_path": "meta-llama/Llama-3.2-3B",
  "peft_type": "ADALORA",
  "task_type": "CAUSAL_LM",
  "r": 8,
  "target_r": 16,
  "lora_alpha": 16,
  "lora_dropout": 0.0,
  "init_r": 24,
  "tinit": 20,
  "tfinal": 250,
  "deltaT": 10,
  "total_step": 300,
  "beta1": 0.85,
  "beta2": 0.85,
  "orth_reg_weight": 0.5,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj",
    "gate_proj",
    "up_proj",
    "down_proj"
  ],
  "bias": "none",
  "inference_mode": false,
  "fan_in_fan_out": false
}
