{
  "apply_GS": false,
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "bias": "none",
  "exclude_modules": null,
  "inference_mode": false,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "peft_type": "HRA",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "r": 32,
  "revision": null,
  "target_modules": [
    "to_out.0",
    "to_add_out",
    "to_qkv_mlp_proj",
    "add_k_proj",
    "add_q_proj",
    "add_v_proj",
    "to_add_out",
    "to_k",
    "to_q",
    "to_v",
    "linear_in",
    "linear_out"
  ],
  "task_type": null
}
