{
  "base_model_name_or_path": "Qwen/Qwen3.5-4B",
  "peft_type": "BOFT",
  "boft_block_size": 4,
  "boft_n_butterfly_factor": 2,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj"
  ],
  "task_type": "CAUSAL_LM"
}