{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "fan_in_fan_out": false,
  "inference_mode": false,
  "init_weights": true,
  "mask_type": "random",
  "modules_to_save": null,
  "peft_type": "SHIRA",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "r": 32,
  "random_seed": null,
  "revision": null,
  "target_modules": [
    "to_q",
    "add_q_proj",
    "add_k_proj",
    "add_v_proj",
    "to_k",
    "to_v",
    "to_add_out",
    "linear_in",
    "linear_out",
    "to_qkv_mlp_proj",
    "to_out.0"
  ],
  "task_type": null
}