{
  "base_model_name_or_path": "Qwen/Qwen3.5-4B",
  "peft_type": "OFT",
  "r": 8,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj"
  ],
  "task_type": "CAUSAL_LM",
  "coft": true,
  "block_share": false
}
