{
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "exclude_modules": null,
  "inference_mode": false,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "num_B": 2,
  "peft_type": "LILY",
  "peft_version": "0.18.2.dev0@UNKNOWN",
  "r": 140,
  "revision": null,
  "scaling": 8.0,
  "stride_A": 14,
  "target_modules": ["gate_proj", "up_proj", "down_proj"],
  "task_type": null
}
