{
    "adapter_layers": 28,
    "adapter_len": 100,
    "auto_mapping": null,
    "base_model_name_or_path": null,
    "inference_mode": false,
    "peft_type": "ADAPTION_PROMPT",
    "peft_version": "0.19.2.dev0@UNKNOWN",
    "revision": null,
    "target_modules": null,
    "task_type": null
}