{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "ModelEmbConv1D",
    "parent_library": "test_regression"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "fan_in_fan_out": true,
  "inference_mode": true,
  "init_lora_weights": false,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 8,
  "lora_dropout": 0.0,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "conv1d",
    "emb"
  ],
  "task_type": null
}