{
  "auto_mapping": {
    "base_model_class": "LlamaForSequenceClassification",
    "parent_library": "transformers.models.llama.modeling_llama"
  },
  "base_model_name_or_path": "TinyLlama/TinyLlama-1.1B-Chat-v1.0",
  "bias": "none",
  "diag_alpha": 1.0,
  "diag_dropout": 0.0,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_diag_weights": true,
  "modules_to_save": null,
  "peft_type": "DIAG",
  "revision": null,
  "target_modules": [
    "q_proj",
    "v_proj"
  ],
  "task_type": null
}