{
    "alpha_pattern": {},
    "auto_mapping": null,
    "base_model_name_or_path": null,
    "bias": "none",
    "corda_config": null,
    "eva_config": null,
    "exclude_modules": null,
    "fan_in_fan_out": false,
    "inference_mode": false,
    "init_lora_weights": true,
    "layer_replication": null,
    "layers_pattern": null,
    "layers_to_transform": null,
    "loftq_config": {},
    "lora_alpha": 28,
    "lora_bias": false,
    "lora_dropout": 0.0,
    "megatron_config": null,
    "megatron_core": "megatron.core",
    "modules_to_save": null,
    "peft_type": "LORA",
    "r": 14,
    "rank_pattern": {},
    "revision": null,
    "target_modules": [
        "gate_proj",
        "up_proj",
        "down_proj"
    ],
    "task_type": "CAUSAL_LM",
    "use_dora": false,
    "use_rslora": false,
    "use_bdlora": {
        "target_modules_bd_a": [
            "o_proj",
            "down_proj"
        ],
        "target_modules_bd_b": [
            "q_proj",
            "v_proj",
            "k_proj",
            "up_proj",
            "gate_proj"
        ],
        "nblocks": 2
    }
}